In [3]:
import pandas as pd
df = pd.read_csv(r"C:\\Users\\Natan\\OneDrive\\Documents\\Victor-projects\\projetos_python\\Data_analysis\\salaries-mls\\2017\\mls-salaries-2017.csv")
df

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
...,...,...,...,...,...,...
611,VAN,Tornaghi,Paolo,GK,80000.0,80000.00
612,VAN,Waston,Kendall,D,350000.0,368125.00
613,VAN,Williams,Sheanon,D,175000.0,184000.00
614,NaN,Babouli,Mo,F,54075.0,54075.00
615,NaN,Ramajo,David Mateos,D,420000.0,453333.33

In [4]:
df['full_name'] = df['first_name'] + ' ' + df['last_name'] + ' ' + df['club']
df_agrupado = df.groupby('full_name', as_index=False)['base_salary'].max()
df_agrupado = df_agrupado.sort_values(by='base_salary', ascending=False)
df_agrupado

                      full_name  base_salary
444         Michael Bradley TOR   6000000.00
181           David Villa NYCFC   5610000.00
534      Sebastian Giovinco TOR   5600000.00
37           Andrea Pirlo NYCFC   5600000.00
68   Bastian Schweinsteiger CHI   5400000.00
..                          ...          ...
299          Jesus Ferreira DAL     53000.00
185        Derrick Etienne NYRB     53000.00
103          Bryan Reynolds DAL     53000.00
474             Nouhou Tolo SEA     52999.92
532            Sean Okoli NYCFC     52999.92

[610 rows x 2 columns]

In [5]:
df_agrupado = df.groupby('position')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

position
M/F    550000.000000
F      489588.598349
M      376106.218632
F-M    335834.000000
M-D    219032.250000
M-F    212975.604211
D      166574.093784
GK     146472.515538
D-M    134930.000000
F/M    125000.000000
Name: base_salary, dtype: float64

In [6]:
df_agrupado = df.groupby('club')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

club
TOR      743516.555556
NYCFC    620375.917143
CHI      454541.629630
ORL      412735.126667
LA       364209.875556
SEA      359468.115600
POR      344241.927407
COL      279028.798077
ATL      259213.420645
RSL      253942.238519
KC       239378.769231
NE       235086.663043
NYRB     225499.357143
SJ       221709.172414
VAN      220011.440000
CLB      211507.749333
PHI      210221.806452
DAL      206571.699310
MTL      187950.780741
MNUFC    182446.149630
DC       178227.238519
HOU      175144.642143
LAFC      59004.000000
Name: base_salary, dtype: float64

In [7]:
df['base_salary'].mean()

296977.7368668831

In [8]:
df_filtered = df[df['base_salary'] < 1500000]
df_filtered['base_salary'].mean()

200516.5304180602